[Killed] BlockStatement
extraction/domain/service/extraire-flux.domain-service.ts:15:61
 	) {
 	}
 
-	public async extraire(flux: FluxExtraction): Promise<void> {
-		const contenuDuFlux = await this.fluxRepository.recuperer(flux);
-		await this.sauvegarderLeFlux(flux, contenuDuFlux);
-	}
+	public async extraire(flux: FluxExtraction): Promise<void> {}
 
 	private async sauvegarderLeFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {
killedBy: ExtraireFluxTest Lorsque j'extrais un flux avec la bonne configuration je stocke le flux extrait
statusReason: expected stub to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
extraction/domain/service/extraire-flux.domain-service.ts:20:94
 		await this.sauvegarderLeFlux(flux, contenuDuFlux);
 	}
 
-	private async sauvegarderLeFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {
-		await this.historiserLeFlux(flux, contenuDuFlux);
-		await this.sauvegarderDerniereVersionDuFlux(flux, contenuDuFlux);
-	}
+	private async sauvegarderLeFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {}
 
 	private async historiserLeFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {
killedBy: ExtraireFluxTest Lorsque j'extrais un flux avec la bonne configuration je stocke le flux extrait
statusReason: expected stub to have been called exactly twice, but it was called 0 times

[Killed] BlockStatement
extraction/domain/service/extraire-flux.domain-service.ts:25:93
 		await this.sauvegarderDerniereVersionDuFlux(flux, contenuDuFlux);
 	}
 
-	private async historiserLeFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {
-		const nomDuFichierHistorise = this.creerNomDuFichierAHistoriser(flux);
-		await this.fluxRepository.enregistrer(nomDuFichierHistorise, contenuDuFlux, flux);
-	}
+	private async historiserLeFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {}
 
 	private async sauvegarderDerniereVersionDuFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {
killedBy: ExtraireFluxTest Lorsque j'extrais un flux avec la bonne configuration je stocke le flux extrait
statusReason: expected stub to have been called exactly twice, but it was called once
    stub('tousmobilises/latest.json', '<toto>Le Contenu</toto>', FluxExtraction {
  nom: 'tousmobilises',
  extension: '.json',
  dossierHistorisation: 'history',
  url: 'http://some.url'
}) at ExtraireFluxDomainService.<anonymous> (/Users/sebastien.francois/Workspace/1j1s/1j1s-stage-orchestrateur-etl/.stryker-tmp/sandbox68129

[Killed] BlockStatement
extraction/domain/service/extraire-flux.domain-service.ts:30:109
 		await this.fluxRepository.enregistrer(nomDuFichierHistorise, contenuDuFlux, flux);
 	}
 
-	private async sauvegarderDerniereVersionDuFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {
-		const nomDuDernierFicher = this.creerNomDuDernierFichier(flux);
-		await this.fluxRepository.enregistrer(nomDuDernierFicher, contenuDuFlux, flux);
-	}
+	private async sauvegarderDerniereVersionDuFlux(flux: FluxExtraction, contenuDuFlux: string): Promise<void> {}
 
 	private creerNomDuFichierAHistoriser(flux: FluxExtraction): string {
killedBy: ExtraireFluxTest Lorsque j'extrais un flux avec la bonne configuration je stocke le flux extrait
statusReason: expected stub to have been called exactly twice, but it was called once
    stub('tousmobilises/history/2022-01-01T00:00:00.000Z.json', '<toto>Le Contenu</toto>', FluxExtraction {
  nom: 'tousmobilises',
  extension: '.json',
  dossierHistorisation: 'history',
  url: 'http://some.url'
}) at ExtraireFluxDomainService.<anonymous> (/Users/sebastien.francois/Workspace/1j1s/1j1s-stage-orchestrateur-etl
