[Timeout] LogicalOperator
domain/service/jobteaser/convertir.domain-service.ts:78:17
 			source: UnJeune1Solution.Source.JOBTEASER,
 			urlDeCandidature: offreDeStage.external_url,
 			teletravailPossible: undefined,
-			dateDeDebut: offreDeStage.start_date || maintenant,
+			dateDeDebut: offreDeStage.start_date && maintenant,
 			sourceCreatedAt: offreDeStage.date_created,
 			sourceUpdatedAt: offreDeStage.date_created,

[Survived] BlockStatement
domain/service/jobteaser/convertir.domain-service.ts:116:19
 		if (!duree) {
 			return undefined;
 		}
-		if (duree.type) {
-			return Number(duree.amount) * Convertir.NOMBRE_DE_JOURS_DANS_UN_MOIS_POUR_CALCUL;
-		}
+		if (duree.type) {}
 		return Number(duree.amount);
 	}

[Timeout] ArithmeticOperator
domain/service/jobteaser/convertir.domain-service.ts:117:11
 			return undefined;
 		}
 		if (duree.type) {
-			return Number(duree.amount) * Convertir.NOMBRE_DE_JOURS_DANS_UN_MOIS_POUR_CALCUL;
+			return Number(duree.amount) / Convertir.NOMBRE_DE_JOURS_DANS_UN_MOIS_POUR_CALCUL;
 		}
 		return Number(duree.amount);
