[Killed] ConditionalExpression
domain/service/studapart/convertir.domain-service.ts:81:4
 
 	private depuisTypeDeBien(typeDeBien: Studapart.TypeDeBien): UnJeune1Solution.TypeBien {
 		switch (typeDeBien) {
-			case "apartment": return UnJeune1Solution.TypeBien.APPARTEMENT;
+			case "apartment":
 			case "house": return UnJeune1Solution.TypeBien.MAISON;
 			default: return UnJeune1Solution.TypeBien.NON_RENSEIGNE;
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }

[Timeout] ConditionalExpression
domain/service/studapart/convertir.domain-service.ts:82:4
 	private depuisTypeDeBien(typeDeBien: Studapart.TypeDeBien): UnJeune1Solution.TypeBien {
 		switch (typeDeBien) {
 			case "apartment": return UnJeune1Solution.TypeBien.APPARTEMENT;
-			case "house": return UnJeune1Solution.TypeBien.MAISON;
+			case "house":
 			default: return UnJeune1Solution.TypeBien.NON_RENSEIGNE;
 		}

[Killed] ConditionalExpression
domain/service/studapart/convertir.domain-service.ts:89:4
 
 	private depuisTypeDAnnonce(typeDannonce: Studapart.TypeDAnnonce): UnJeune1Solution.Type {
 		switch (typeDannonce) {
-			case "service": return UnJeune1Solution.Type.LOGEMENT_CONTRE_SERVICES;
+			case "service":
 			case "homestay": return UnJeune1Solution.Type.LOGEMENT_CHEZ_L_HABITANT;
 			case "rental": return UnJeune1Solution.Type.LOCATION;
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type service, avec toutes les options je retourne un logement UnJeuneUneSolution avec tous les services inclus
statusReason: expected { …(25) } to deeply equal { …(25) }

[Timeout] ConditionalExpression
domain/service/studapart/convertir.domain-service.ts:90:4
 	private depuisTypeDAnnonce(typeDannonce: Studapart.TypeDAnnonce): UnJeune1Solution.Type {
 		switch (typeDannonce) {
 			case "service": return UnJeune1Solution.Type.LOGEMENT_CONTRE_SERVICES;
-			case "homestay": return UnJeune1Solution.Type.LOGEMENT_CHEZ_L_HABITANT;
+			case "homestay":
 			case "rental": return UnJeune1Solution.Type.LOCATION;
 			default: return UnJeune1Solution.Type.NON_RENSEIGNE;

[Timeout] ConditionalExpression
domain/service/studapart/convertir.domain-service.ts:91:4
 		switch (typeDannonce) {
 			case "service": return UnJeune1Solution.Type.LOGEMENT_CONTRE_SERVICES;
 			case "homestay": return UnJeune1Solution.Type.LOGEMENT_CHEZ_L_HABITANT;
-			case "rental": return UnJeune1Solution.Type.LOCATION;
+			case "rental":
 			default: return UnJeune1Solution.Type.NON_RENSEIGNE;
 		}

[Killed] EqualityOperator
domain/service/studapart/convertir.domain-service.ts:100:6
 		if(!rooms) {
 			return 0;
 		}
-		if(rooms.length > 1) {
+		if(rooms.length <= 1) {
 			return this.extraireValeurMinimumDeLaGarantieDesChambres(rooms);
 		} else {
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type house, homestay avec plusieurs pièces et 2 étages je retourne un logement UnJeuneUneSolution de type Maison avec 2 étages avec la plus pet
statusReason: expected { …(25) } to deeply equal { …(25) }

[Survived] EqualityOperator
domain/service/studapart/convertir.domain-service.ts:100:6
 		if(!rooms) {
 			return 0;
 		}
-		if(rooms.length > 1) {
+		if(rooms.length >= 1) {
 			return this.extraireValeurMinimumDeLaGarantieDesChambres(rooms);
 		} else {

[Killed] MethodExpression
domain/service/studapart/convertir.domain-service.ts:113:11
 
 	private depuisOptionLogements(optionsLogement?: Studapart.OptionsLogement): Array<UnJeune1Solution.ServiceInclus> {
 		if(optionsLogement) {
-			return Object
-				.entries(optionsLogement)
-				.filter(([key, studapartBoolean]) => key !== undefined && studapartBoolean.value)
+			return Object.entries(optionsLogement)
 				.map(([key]) => ({ nom: optionsLogementTraduitEnUnJeuneUneSolution[key] }));
 		} else return [];
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }

[Killed] LogicalOperator
domain/service/studapart/convertir.domain-service.ts:115:42
 		if(optionsLogement) {
 			return Object
 				.entries(optionsLogement)
-				.filter(([key, studapartBoolean]) => key !== undefined && studapartBoolean.value)
+				.filter(([key, studapartBoolean]) => key !== undefined || studapartBoolean.value)
 				.map(([key]) => ({ nom: optionsLogementTraduitEnUnJeuneUneSolution[key] }));
 		} else return [];
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }

[Killed] ConditionalExpression
domain/service/studapart/convertir.domain-service.ts:115:42
 		if(optionsLogement) {
 			return Object
 				.entries(optionsLogement)
-				.filter(([key, studapartBoolean]) => key !== undefined && studapartBoolean.value)
+				.filter(([key, studapartBoolean]) => true)
 				.map(([key]) => ({ nom: optionsLogementTraduitEnUnJeuneUneSolution[key] }));
 		} else return [];
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }
