[Killed] BooleanLiteral
chargement/domain/service/charger-offres-de-stage.domain-service.ts:51:59
 	}
 
-		return offresDeStageMisesAJour.filter((offreDeStage) => !offresDeStageSansEmployeur.includes(offreDeStage));
+		return offresDeStageMisesAJour.filter((offreDeStage) => offresDeStageSansEmployeur.includes(offreDeStage));
 	}
 
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAPublier {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Timeout] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:51:41
 	}
 
-		return offresDeStageMisesAJour.filter((offreDeStage) => !offresDeStageSansEmployeur.includes(offreDeStage));
+		return offresDeStageMisesAJour.filter(() => undefined);
 	}
 

[Timeout] BlockStatement
chargement/domain/service/charger-offres-de-stage.domain-service.ts:62:19
 		offresDeStageASupprimer: Array<UnJeune1Solution.OffreDeStageASupprimer>,
 		offresDeStageEnErreur: Array<UnJeune1Solution.OffreDeStageEnErreur>,
 		offresDeStageSansEmployeur: Array<UnJeune1Solution.OffreDeStage>,
-	): Promise<void> {
-		const { CREATED, UPDATED, DELETED, ERROR, SANS_EMPLOYEUR } = ChargerOffresDeStageDomainService;
-		const parametresDesFichiersDeResultat = {
-			nomDuFlux,
-			nomDuFichier: this.dateService.maintenant(),
-			extensionDuFichier: extensionDuFichierDeResultat,
-		};
-
-		await this.enregistrerLeResultat(CREATED, offresDeStageAPublier, parametresDesFichiersDeResultat);
-		await this.enregistrerLeResultat(UPDATED, offresDeStageAMettreAJour, parametresDesFichiersDeResultat);
-		await this.enregistrerLeResultat(DELETED, offresDeStageASupprimer, parametresDesFichiersDeResultat);
-		await this.enregistrerLeResultat(ERROR, offresDeStageEnErreur, parametresDesFichiersDeResultat);
-		await this.enregistrerLeResultat(SANS_EMPLOYEUR, offresDeStageSansEmployeur, parametresDesFichiersDeResultat);
-	}
+	): Promise<void> {}
 
 	private extaireLesOffresASupprimer(

[Timeout] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:81:10
 		offresDeStageExistantes: Array<UnJeune1Solution.OffreDeStageExistante>,
 		identifiantsSourceDesOffresMisesAJour: Array<string | undefined>,
 	): Array<UnJeune1Solution.OffreDeStageASupprimer> {
-		return offresDeStageExistantes
-			.filter((offreDeStageExistante) => this.offreDeStageQuiNExistePlus(identifiantsSourceDesOffresMisesAJour, offreDeStageExistante))
+		return offresDeStageExistantes
 			.map((offreDeStageExistante) => {
 

[Killed] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:82:12
 		identifiantsSourceDesOffresMisesAJour: Array<string | undefined>,
 	): Array<UnJeune1Solution.OffreDeStageASupprimer> {
 		return offresDeStageExistantes
-			.filter((offreDeStageExistante) => this.offreDeStageQuiNExistePlus(identifiantsSourceDesOffresMisesAJour, offreDeStageExistante))
+			.filter(() => undefined)
 			.map((offreDeStageExistante) => {
 
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages qui n'existent plus Je charge les mises à jour nécessaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageASupprimer {
    titre: undefined,
    dateDeDebut: undefined,
    description: undefined,
    urlDeCandidature: undefined,
    sourceCreatedAt: undefined,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Killed] BooleanLiteral
chargement/domain/service/charger-offres-de-stage.domain-service.ts:94:10
 	}
 
 	private offreDeStageQuiNExistePlus(identifiantsSourceDesOffresMisesAJour: Array<string | undefined>, offreDeStageExistante: UnJeune1Solution.OffreDeStageExistante): boolean {
-		return !identifiantsSourceDesOffresMisesAJour.includes(offreDeStageExistante.identifiantSource);
+		return identifiantsSourceDesOffresMisesAJour.includes(offreDeStageExistante.identifiantSource);
 	}
 
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:102:10
 		identifiantsSourceDesOffresExistantes: Array<string>,
 		offresDeStageExistantes: Array<UnJeune1Solution.OffreDeStageExistante>
 	): Array<UnJeune1Solution.OffreDeStageAMettreAJour> {
-		return offresDeStageAvecEmployeur
-			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
-			.filter((offreDeStageMiseAJour) => {
-				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
-				return offreDeStageMiseAJour.sourceUpdatedAt > offreDeStageExistante!.sourceUpdatedAt;
-			})
+		return offresDeStageAvecEmployeur.filter(offreDeStageMiseAJour => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
 			.map((offreDeStageAMettreAJour) =>
 				new UnJeune1Solution.OffreDeStageAMettreAJour(
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes dont la date de mise à jour est antérieure à celle connue Je ne ch
statusReason: expected stub to have been called with arguments 'jobteaser', []
'"jobteaser"'
[
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',

[Killed] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:102:10
 		identifiantsSourceDesOffresExistantes: Array<string>,
 		offresDeStageExistantes: Array<UnJeune1Solution.OffreDeStageExistante>
 	): Array<UnJeune1Solution.OffreDeStageAMettreAJour> {
-		return offresDeStageAvecEmployeur
-			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
+		return offresDeStageAvecEmployeur
 			.filter((offreDeStageMiseAJour) => {
 				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: Cannot read properties of undefined (reading 'sourceUpdatedAt')

[Killed] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:103:12
 		offresDeStageExistantes: Array<UnJeune1Solution.OffreDeStageExistante>
 	): Array<UnJeune1Solution.OffreDeStageAMettreAJour> {
 		return offresDeStageAvecEmployeur
-			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
+			.filter(() => undefined)
 			.filter((offreDeStageMiseAJour) => {
 				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] BlockStatement
chargement/domain/service/charger-offres-de-stage.domain-service.ts:104:39
 	): Array<UnJeune1Solution.OffreDeStageAMettreAJour> {
 		return offresDeStageAvecEmployeur
 			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
-			.filter((offreDeStageMiseAJour) => {
-				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
-				return offreDeStageMiseAJour.sourceUpdatedAt > offreDeStageExistante!.sourceUpdatedAt;
-			})
+			.filter((offreDeStageMiseAJour) => {})
 			.map((offreDeStageAMettreAJour) =>
 				new UnJeune1Solution.OffreDeStageAMettreAJour(
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] EqualityOperator
chargement/domain/service/charger-offres-de-stage.domain-service.ts:105:82
 		return offresDeStageAvecEmployeur
 			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
 			.filter((offreDeStageMiseAJour) => {
-				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
+				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource !== offreDeStageMiseAJour.identifiantSource);
 				return offreDeStageMiseAJour.sourceUpdatedAt > offreDeStageExistante!.sourceUpdatedAt;
 			})
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: Cannot read properties of undefined (reading 'sourceUpdatedAt')

[Killed] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:105:64
 		return offresDeStageAvecEmployeur
 			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
 			.filter((offreDeStageMiseAJour) => {
-				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
+				const offreDeStageExistante = offresDeStageExistantes.find(() => undefined);
 				return offreDeStageMiseAJour.sourceUpdatedAt > offreDeStageExistante!.sourceUpdatedAt;
 			})
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: Cannot read properties of undefined (reading 'sourceUpdatedAt')

[Killed] EqualityOperator
chargement/domain/service/charger-offres-de-stage.domain-service.ts:106:12
 			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
 			.filter((offreDeStageMiseAJour) => {
 				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
-				return offreDeStageMiseAJour.sourceUpdatedAt > offreDeStageExistante!.sourceUpdatedAt;
+				return offreDeStageMiseAJour.sourceUpdatedAt <= offreDeStageExistante!.sourceUpdatedAt;
 			})
 			.map((offreDeStageAMettreAJour) =>
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:106:12
 			.filter((offreDeStageMiseAJour) => this.offreDeStageEstDejaExistante(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
 			.filter((offreDeStageMiseAJour) => {
 				const offreDeStageExistante = offresDeStageExistantes.find((offreDeStage) => offreDeStage.identifiantSource === offreDeStageMiseAJour.identifiantSource);
-				return offreDeStageMiseAJour.sourceUpdatedAt > offreDeStageExistante!.sourceUpdatedAt;
+				return false;
 			})
 			.map((offreDeStageAMettreAJour) =>
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] EqualityOperator
chargement/domain/service/charger-offres-de-stage.domain-service.ts:111:62
 			.map((offreDeStageAMettreAJour) =>
 				new UnJeune1Solution.OffreDeStageAMettreAJour(
 					offreDeStageAMettreAJour.recupererAttributs(),
-					offresDeStageExistantes.find((offreDeStageExistante) => offreDeStageExistante.identifiantSource === offreDeStageAMettreAJour.identifiantSource)!.id
+					offresDeStageExistantes.find((offreDeStageExistante) => offreDeStageExistante.identifiantSource !== offreDeStageAMettreAJour.identifiantSource)!.id
 				)
 			);
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:111:62
 			.map((offreDeStageAMettreAJour) =>
 				new UnJeune1Solution.OffreDeStageAMettreAJour(
 					offreDeStageAMettreAJour.recupererAttributs(),
-					offresDeStageExistantes.find((offreDeStageExistante) => offreDeStageExistante.identifiantSource === offreDeStageAMettreAJour.identifiantSource)!.id
+					offresDeStageExistantes.find((offreDeStageExistante) => false)!.id
 				)
 			);
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:117:10
 	}
 
 	private offreDeStageEstDejaExistante(offreDeStageMiseAJour: UnJeune1Solution.OffreDeStage, identifiantsSourceDesOffresExistantes: Array<string>): boolean {
-		return !!offreDeStageMiseAJour.identifiantSource && identifiantsSourceDesOffresExistantes.includes(offreDeStageMiseAJour.identifiantSource);
+		return false;
 	}
 
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:117:10
 	}
 
 	private offreDeStageEstDejaExistante(offreDeStageMiseAJour: UnJeune1Solution.OffreDeStage, identifiantsSourceDesOffresExistantes: Array<string>): boolean {
-		return !!offreDeStageMiseAJour.identifiantSource && identifiantsSourceDesOffresExistantes.includes(offreDeStageMiseAJour.identifiantSource);
+		return true;
 	}
 
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: Cannot read properties of undefined (reading 'sourceUpdatedAt')

[Killed] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:124:10
 		offresDeStageAvecEmployeur: Array<UnJeune1Solution.OffreDeStage>,
 		identifiantsSourceDesOffresExistantes: Array<string>
 	): Array<UnJeune1Solution.OffreDeStageAPublier> {
-		return offresDeStageAvecEmployeur
-			.filter((offreDeStageMiseAJour) => this.offreDeStageNExistePasEncore(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
+		return offresDeStageAvecEmployeur
 			.map((offreDeStage) => new UnJeune1Solution.OffreDeStageAPublier(offreDeStage.recupererAttributs()));
 	}
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Killed] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:125:12
 		identifiantsSourceDesOffresExistantes: Array<string>
 	): Array<UnJeune1Solution.OffreDeStageAPublier> {
 		return offresDeStageAvecEmployeur
-			.filter((offreDeStageMiseAJour) => this.offreDeStageNExistePasEncore(offreDeStageMiseAJour, identifiantsSourceDesOffresExistantes))
+			.filter(() => undefined)
 			.map((offreDeStage) => new UnJeune1Solution.OffreDeStageAPublier(offreDeStage.recupererAttributs()));
 	}
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAPublier {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Killed] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:130:10
 	}
 
 	private offreDeStageNExistePasEncore(offreDeStageMiseAJour: UnJeune1Solution.OffreDeStage, identifiantsSourceDesOffresExistantes: Array<string>): boolean {
-		return !offreDeStageMiseAJour.identifiantSource || !identifiantsSourceDesOffresExistantes.includes(offreDeStageMiseAJour.identifiantSource);
+		return true;
 	}
 
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsqu'il y a des offres de stages existantes Je charge les mise à jours nécéssaires
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAMettreAJour {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-10T00:00:00.000Z,

[Timeout] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:130:10
 	}
 
 	private offreDeStageNExistePasEncore(offreDeStageMiseAJour: UnJeune1Solution.OffreDeStage, identifiantsSourceDesOffresExistantes: Array<string>): boolean {
-		return !offreDeStageMiseAJour.identifiantSource || !identifiantsSourceDesOffresExistantes.includes(offreDeStageMiseAJour.identifiantSource);
+		return false;
 	}
 

[Survived] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:138:10
 	}
 
 	private extaireLesIdentifiantsDeLaMiseAJourDesOffres(offresDeStageMisesAJour: Array<UnJeune1Solution.OffreDeStage>): Array<string | undefined> {
-		return offresDeStageMisesAJour
-			.filter((offreExistante) => offreExistante.identifiantSource)
+		return offresDeStageMisesAJour
 			.map((offreExistante) => offreExistante.identifiantSource);
 	}

[Timeout] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:139:12
 
 	private extaireLesIdentifiantsDeLaMiseAJourDesOffres(offresDeStageMisesAJour: Array<UnJeune1Solution.OffreDeStage>): Array<string | undefined> {
 		return offresDeStageMisesAJour
-			.filter((offreExistante) => offreExistante.identifiantSource)
+			.filter(() => undefined)
 			.map((offreExistante) => offreExistante.identifiantSource);
 	}

[Timeout] ArrowFunction
chargement/domain/service/charger-offres-de-stage.domain-service.ts:140:9
 	private extaireLesIdentifiantsDeLaMiseAJourDesOffres(offresDeStageMisesAJour: Array<UnJeune1Solution.OffreDeStage>): Array<string | undefined> {
 		return offresDeStageMisesAJour
 			.filter((offreExistante) => offreExistante.identifiantSource)
-			.map((offreExistante) => offreExistante.identifiantSource);
+			.map(() => undefined);
 	}
 

[Killed] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:145:7
 
 	private filtrerLesOffresDeStagesSansEmployeur(offresDeStages: Array<UnJeune1Solution.OffreDeStage>): Array<UnJeune1Solution.OffreDeStage> {
 		return [
-			...offresDeStages.filter((offreDeStage) => !offreDeStage.employeur),
+			...offresDeStages,
 			...offresDeStages.filter((offreDeStage) => offreDeStage.employeur?.nom === ""),
 		];
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAPublier {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Killed] BooleanLiteral
chargement/domain/service/charger-offres-de-stage.domain-service.ts:145:47
 
 	private filtrerLesOffresDeStagesSansEmployeur(offresDeStages: Array<UnJeune1Solution.OffreDeStage>): Array<UnJeune1Solution.OffreDeStage> {
 		return [
-			...offresDeStages.filter((offreDeStage) => !offreDeStage.employeur),
+			...offresDeStages.filter((offreDeStage) => offreDeStage.employeur),
 			...offresDeStages.filter((offreDeStage) => offreDeStage.employeur?.nom === ""),
 		];
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAPublier {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Killed] ConditionalExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:146:47
 	private filtrerLesOffresDeStagesSansEmployeur(offresDeStages: Array<UnJeune1Solution.OffreDeStage>): Array<UnJeune1Solution.OffreDeStage> {
 		return [
 			...offresDeStages.filter((offreDeStage) => !offreDeStage.employeur),
-			...offresDeStages.filter((offreDeStage) => offreDeStage.employeur?.nom === ""),
+			...offresDeStages.filter((offreDeStage) => true),
 		];
 	}
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAPublier {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Killed] MethodExpression
chargement/domain/service/charger-offres-de-stage.domain-service.ts:146:7
 	private filtrerLesOffresDeStagesSansEmployeur(offresDeStages: Array<UnJeune1Solution.OffreDeStage>): Array<UnJeune1Solution.OffreDeStage> {
 		return [
 			...offresDeStages.filter((offreDeStage) => !offreDeStage.employeur),
-			...offresDeStages.filter((offreDeStage) => offreDeStage.employeur?.nom === ""),
+			...offresDeStages,
 		];
 	}
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on connait le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je charge les mises à jour des o
statusReason: expected stub to have been called with arguments 'jobteaser', [
  OffreDeStageAPublier {
    titre: "Titre de l'offre",
    dateDeDebut: '2022-06-01T00:00:00.000Z',
    description: "Description de l'offre",
    urlDeCandidature: 'http://url.de.candidature.com',
    sourceCreatedAt: 2022-01-01T00:00:00.000Z,
    sourceUpdatedAt: 2022-01-01T00:00:00.000Z,

[Killed] BlockStatement
chargement/domain/service/charger-offres-de-stage.domain-service.ts:154:19
 		typeDeResultat: string,
 		offresDeStage: Array<UnJeune1Solution.OffreDeStage> | Array<UnJeune1Solution.OffreDeStageEnErreur>,
 		parametres: { nomDuFlux: string, nomDuFichier: Date, extensionDuFichier: string },
-	): Promise<void> {
-		const contenu = this.versJSONLisible(offresDeStage);
-		const nomDuFichierDeResultat = this.creerLeNomDuFichierDeResultat(
-			parametres.nomDuFlux,
-			parametres.nomDuFichier,
-			parametres.extensionDuFichier,
-			typeDeResultat
-		);
-		await this.offreDeStageRepository.enregistrer(nomDuFichierDeResultat, contenu, parametres.nomDuFlux);
-	}
+	): Promise<void> {}
 
 	private versJSONLisible(offresDeStage: Array<UnJeune1Solution.OffreDeStage> | Array<UnJeune1Solution.OffreDeStageEnErreur>): string {
killedBy: ChargerOffresDeStageDomainServiceTest Lorsque je charge le flux dont on me donne le nom Lorsque l'on ne connait pas le(s) employeur(s) d'une ou plusieurs offre(s) de stage(s) Je sauvegarde les offres 
statusReason: Cannot read properties of null (reading 'args')
