[NoCoverage] StringLiteral
src/configuration/configuration.ts:86:69
 		const DOMAINS = [Domain.EVENTS, Domain.HOUSING, Domain.INTERNSHIPS];
 
 		return {
-			APPLICATION_LOGGER_NAME: getOrDefault("APPLICATION_LOGGER_NAME", "application"),
+			APPLICATION_LOGGER_NAME: getOrDefault("APPLICATION_LOGGER_NAME", ""),
 			APPLICATION_LOGGER_LOG_LEVEL: getOrDefault("APPLICATION_LOGGER_LOG_LEVEL", "debug") as LogLevel,
 			APPLICATION_CONTEXT: "application",

[NoCoverage] StringLiteral
src/configuration/configuration.ts:86:42
 		const DOMAINS = [Domain.EVENTS, Domain.HOUSING, Domain.INTERNSHIPS];
 
 		return {
-			APPLICATION_LOGGER_NAME: getOrDefault("APPLICATION_LOGGER_NAME", "application"),
+			APPLICATION_LOGGER_NAME: getOrDefault("", "application"),
 			APPLICATION_LOGGER_LOG_LEVEL: getOrDefault("APPLICATION_LOGGER_LOG_LEVEL", "debug") as LogLevel,
 			APPLICATION_CONTEXT: "application",

[NoCoverage] StringLiteral
src/configuration/configuration.ts:94:17
 			EVENTS: {
 				EXTRACT_LOG_LEVEL: getOrDefault("EVENTS_EXTRACT_LOG_LEVEL", "debug") as LogLevel,
 				FLOWS: [
-					getOrError("EVENTS_TOUS_MOBILISES_NAME"),
+					getOrError(""),
 				],
 				LOAD_LOG_LEVEL: getOrDefault("EVENTS_LOAD_LOG_LEVEL", "debug") as LogLevel,

[NoCoverage] ArrayDeclaration
src/configuration/configuration.ts:101:12
 			},
 			HOUSING: {
 				EXTRACT_LOG_LEVEL: getOrDefault("HOUSING_EXTRACT_LOG_LEVEL", "debug") as LogLevel,
-				FLOWS: [
-					getOrError("HOUSING_IMMOJEUNE_NAME"),
-					getOrError("HOUSING_STUDAPART_NAME"),
-				],
+				FLOWS: [],
 				LOAD_LOG_LEVEL: getOrDefault("HOUSING_LOAD_LOG_LEVEL", "debug") as LogLevel,
 				TRANSFORM_LOG_LEVEL: getOrDefault("HOUSING_LOAD_LOG_LEVEL", "debug") as LogLevel,

[NoCoverage] StringLiteral
src/configuration/configuration.ts:102:17
 			HOUSING: {
 				EXTRACT_LOG_LEVEL: getOrDefault("HOUSING_EXTRACT_LOG_LEVEL", "debug") as LogLevel,
 				FLOWS: [
-					getOrError("HOUSING_IMMOJEUNE_NAME"),
+					getOrError(""),
 					getOrError("HOUSING_STUDAPART_NAME"),
 				],

[NoCoverage] StringLiteral
src/configuration/configuration.ts:110:46
 			},
 			MINIO: {
 				ACCESS_KEY: getOrError("MINIO_ACCESS_KEY"),
-				DAYS_AFTER_EXPIRATION: Number(getOrError("MINIO_DAYS_AFTER_EXPIRATION")),
+				DAYS_AFTER_EXPIRATION: Number(getOrError("")),
 				EVENTS_MINIO_RAW_BUCKET_NAME: getOrError("EVENTS_MINIO_RAW_BUCKET_NAME"),
 				EVENTS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("EVENTS_MINIO_TRANSFORMED_BUCKET_NAME"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:112:54
 				ACCESS_KEY: getOrError("MINIO_ACCESS_KEY"),
 				DAYS_AFTER_EXPIRATION: Number(getOrError("MINIO_DAYS_AFTER_EXPIRATION")),
 				EVENTS_MINIO_RAW_BUCKET_NAME: getOrError("EVENTS_MINIO_RAW_BUCKET_NAME"),
-				EVENTS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("EVENTS_MINIO_TRANSFORMED_BUCKET_NAME"),
+				EVENTS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError(""),
 				EVENTS_MINIO_RESULT_BUCKET_NAME: getOrError("EVENTS_MINIO_RESULT_BUCKET_NAME"),
 				HISTORY_DIRECTORY_NAME: getOrDefault("MINIO_HISTORY_DIRECTORY_NAME", "history"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:114:42
 				EVENTS_MINIO_RAW_BUCKET_NAME: getOrError("EVENTS_MINIO_RAW_BUCKET_NAME"),
 				EVENTS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("EVENTS_MINIO_TRANSFORMED_BUCKET_NAME"),
 				EVENTS_MINIO_RESULT_BUCKET_NAME: getOrError("EVENTS_MINIO_RESULT_BUCKET_NAME"),
-				HISTORY_DIRECTORY_NAME: getOrDefault("MINIO_HISTORY_DIRECTORY_NAME", "history"),
+				HISTORY_DIRECTORY_NAME: getOrDefault("", "history"),
 				HOUSING_MINIO_RAW_BUCKET_NAME: getOrError("HOUSING_MINIO_RAW_BUCKET_NAME"),
 				HOUSING_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("HOUSING_MINIO_TRANSFORMED_BUCKET_NAME"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:116:55
 				EVENTS_MINIO_RESULT_BUCKET_NAME: getOrError("EVENTS_MINIO_RESULT_BUCKET_NAME"),
 				HISTORY_DIRECTORY_NAME: getOrDefault("MINIO_HISTORY_DIRECTORY_NAME", "history"),
 				HOUSING_MINIO_RAW_BUCKET_NAME: getOrError("HOUSING_MINIO_RAW_BUCKET_NAME"),
-				HOUSING_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("HOUSING_MINIO_TRANSFORMED_BUCKET_NAME"),
+				HOUSING_MINIO_TRANSFORMED_BUCKET_NAME: getOrError(""),
 				HOUSING_MINIO_RESULT_BUCKET_NAME: getOrError("HOUSING_MINIO_RESULT_BUCKET_NAME"),
 				INTERNSHIPS_MINIO_RAW_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RAW_BUCKET_NAME"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:119:59
 				HOUSING_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("HOUSING_MINIO_TRANSFORMED_BUCKET_NAME"),
 				HOUSING_MINIO_RESULT_BUCKET_NAME: getOrError("HOUSING_MINIO_RESULT_BUCKET_NAME"),
 				INTERNSHIPS_MINIO_RAW_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RAW_BUCKET_NAME"),
-				INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME"),
+				INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError(""),
 				INTERNSHIPS_MINIO_RESULT_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RESULT_BUCKET_NAME"),
 				LIFECYCLE_RULES_STATUS: toValidEnableStatus(getOrError("MINIO_LIFECYCLE_RULES_STATUS")),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:120:54
 				HOUSING_MINIO_RESULT_BUCKET_NAME: getOrError("HOUSING_MINIO_RESULT_BUCKET_NAME"),
 				INTERNSHIPS_MINIO_RAW_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RAW_BUCKET_NAME"),
 				INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME"),
-				INTERNSHIPS_MINIO_RESULT_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RESULT_BUCKET_NAME"),
+				INTERNSHIPS_MINIO_RESULT_BUCKET_NAME: getOrError(""),
 				LIFECYCLE_RULES_STATUS: toValidEnableStatus(getOrError("MINIO_LIFECYCLE_RULES_STATUS")),
 				PORT: Number(getOrDefault("MINIO_PORT", DEFAULT_MINIO_PORT)),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:121:60
 				INTERNSHIPS_MINIO_RAW_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RAW_BUCKET_NAME"),
 				INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_TRANSFORMED_BUCKET_NAME"),
 				INTERNSHIPS_MINIO_RESULT_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RESULT_BUCKET_NAME"),
-				LIFECYCLE_RULES_STATUS: toValidEnableStatus(getOrError("MINIO_LIFECYCLE_RULES_STATUS")),
+				LIFECYCLE_RULES_STATUS: toValidEnableStatus(getOrError("")),
 				PORT: Number(getOrDefault("MINIO_PORT", DEFAULT_MINIO_PORT)),
 				SECRET_KEY: getOrError("MINIO_SECRET_KEY"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:123:28
 				INTERNSHIPS_MINIO_RESULT_BUCKET_NAME: getOrError("INTERNSHIPS_MINIO_RESULT_BUCKET_NAME"),
 				LIFECYCLE_RULES_STATUS: toValidEnableStatus(getOrError("MINIO_LIFECYCLE_RULES_STATUS")),
 				PORT: Number(getOrDefault("MINIO_PORT", DEFAULT_MINIO_PORT)),
-				SECRET_KEY: getOrError("MINIO_SECRET_KEY"),
+				SECRET_KEY: getOrError(""),
 				TRANSFORMED_FILE_EXTENSION: getOrError("MINIO_TRANSFORMED_FILE_EXTENSION"),
 				URL: getOrError("MINIO_URL"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:138:17
 				FEATURE_FLIPPING_CHARGEMENT: toBoolean(getOrDefault("INTERNSHIPS_FEATURE_FLIPPING_CHARGEMENT", "false")),
 				FLOWS: [
 					getOrError("INTERNSHIPS_JOBTEASER_NAME"),
-					getOrError("INTERNSHIPS_STAGEFR_COMPRESSED_NAME"),
+					getOrError(""),
 					getOrError("INTERNSHIPS_STAGEFR_UNCOMPRESSED_NAME"),
 				],

[NoCoverage] StringLiteral
src/configuration/configuration.ts:146:26
 			},
 			STRAPI: {
 				AUTHENTICATION_URL: getOrError("STRAPI_AUTHENTICATION_URL"),
-				BASE_URL: getOrError("STRAPI_BASE_URL"),
+				BASE_URL: getOrError(""),
 				OFFRE_DE_STAGE_URL: getOrError("STRAPI_OFFRE_DE_STAGE_URL"),
 				PASSWORD: getOrError("STRAPI_PASSWORD"),

[NoCoverage] StringLiteral
src/configuration/configuration.ts:147:36
 			STRAPI: {
 				AUTHENTICATION_URL: getOrError("STRAPI_AUTHENTICATION_URL"),
 				BASE_URL: getOrError("STRAPI_BASE_URL"),
-				OFFRE_DE_STAGE_URL: getOrError("STRAPI_OFFRE_DE_STAGE_URL"),
+				OFFRE_DE_STAGE_URL: getOrError(""),
 				PASSWORD: getOrError("STRAPI_PASSWORD"),
 				USERNAME: getOrError("STRAPI_USERNAME"),

[NoCoverage] MethodExpression
src/configuration/configuration.ts:172:10
 	}
 
 	private static toBoolean(value: string): boolean {
-		return value.trim().toLowerCase() === "true";
+		return value.trim().toUpperCase() === "true";
 	}
 

[NoCoverage] ConditionalExpression
src/configuration/configuration.ts:172:10
 	}
 
 	private static toBoolean(value: string): boolean {
-		return value.trim().toLowerCase() === "true";
+		return false;
 	}
 

[NoCoverage] ConditionalExpression
src/configuration/configuration.ts:176:34
 	}
 
 	private static toValidEnableStatus(value: string): "Enabled" | "Disabled" {
-		return (value === "Enabled" || value === "Disabled") ? value : "Disabled";
+		return (value === "Enabled" || false) ? value : "Disabled";
 	}
 }

[NoCoverage] ConditionalExpression
src/configuration/configuration.ts:176:11
 	}
 
 	private static toValidEnableStatus(value: string): "Enabled" | "Disabled" {
-		return (value === "Enabled" || value === "Disabled") ? value : "Disabled";
+		return (false || value === "Disabled") ? value : "Disabled";
 	}
 }
