[NoCoverage] BlockStatement
evenements/chargement/application-service/charger-flux-tous-mobilises.usecase.ts:10:50
   constructor(private readonly domain: ChargerEvenenementsDomainService) {}
 
 
-  async executer(nomFlux: string): Promise<void> {
-    return this.domain.charger(nomFlux);
-  }
+  async executer(nomFlux: string): Promise<void> {}
 
 }
