[Timeout] BlockStatement
chargement/domain/service/charger-evenements.domain-service.ts:7:55
 	constructor(private readonly evenementsRepository: UnJeuneUneSolution.EvenementsRepository) {
 	}
 
-	public async charger(nomFlux: string): Promise<void> {
-		const evenementsExistants = await this.evenementsRepository.recupererEvenementsDejaCharges(nomFlux);
-		const evenementsACharger = await this.evenementsRepository.recupererNouveauxEvenementsACharger(nomFlux);
-
-		const evenementsAAjouter = this.getEvenementsAAjouter(evenementsACharger, evenementsExistants);
-
-		const evenementsAMettreAjour = this.getEvenementsAMettreAjour(evenementsACharger, evenementsExistants);
-
-		const evenementsASupprimer = this.getEvenementsASupprimer(evenementsExistants, evenementsACharger);
-
-		const evenementsEnErreur = await this.evenementsRepository.chargerEtEnregistrerLesErreurs(evenementsAAjouter, evenementsAMettreAjour, evenementsASupprimer);
-
-		await this.sauvegarderLesEvenements(evenementsEnErreur, nomFlux, evenementsAAjouter, evenementsAMettreAjour, evenementsASupprimer);
-	}
+	public async charger(nomFlux: string): Promise<void> {}
 

[Killed] EqualityOperator
chargement/domain/service/charger-evenements.domain-service.ts:23:3
 	}
 
-		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
+		evenementsEnErreur.length <= 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
 		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
 		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'ERROR', [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] LogicalOperator
chargement/domain/service/charger-evenements.domain-service.ts:23:3
 	}
 
-		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
+		evenementsEnErreur.length > 0 || (await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur));
 		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
 		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'ERROR', [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:24:3
 
 		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
-		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
+		true;
 		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
 		evenementsASupprimer.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'CREATED', [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:24:3
 
 		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
-		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
+		false;
 		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
 		evenementsASupprimer.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'CREATED', [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] EqualityOperator
chargement/domain/service/charger-evenements.domain-service.ts:25:3
 		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
 		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
-		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
+		evenementsAMettreAjour.length <= 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
 		evenementsASupprimer.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'UPDATED', [
  {
    id: 3,
    dateDebut: '2022-11-26T09:30:00',
    description: 'description',
    idSource: '272739',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:25:3
 		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
 		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
-		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
+		true;
 		evenementsASupprimer.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'UPDATED', [
  {
    id: 3,
    dateDebut: '2022-11-26T09:30:00',
    description: 'description',
    idSource: '272739',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] EqualityOperator
chargement/domain/service/charger-evenements.domain-service.ts:26:3
 		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
 		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
 		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
-		evenementsASupprimer.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
+		evenementsASupprimer.length <= 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
 	}
 
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'DELETED', [
  {
    id: 1,
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] LogicalOperator
chargement/domain/service/charger-evenements.domain-service.ts:26:3
 		evenementsEnErreur.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "ERROR", evenementsEnErreur);
 		evenementsAAjouter.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "CREATED", evenementsAAjouter);
 		evenementsAMettreAjour.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "UPDATED", evenementsAMettreAjour);
-		evenementsASupprimer.length > 0 && await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer);
+		evenementsASupprimer.length > 0 || (await this.evenementsRepository.sauvegarder(nomFlux, "DELETED", evenementsASupprimer));
 	}
 
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer puis quan
statusReason: expected stub to have been called with arguments 'nomFlux', 'DELETED', [
  {
    id: 1,
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] MethodExpression
chargement/domain/service/charger-evenements.domain-service.ts:30:10
 	}
 
-		return evenementsACharger.filter(evenementACharger =>
-			!evenementsExistants.find(evenementExistant => evenementExistant.idSource === evenementACharger.idSource)
-		);
+		return evenementsACharger;
 	}
 
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] ArrowFunction
chargement/domain/service/charger-evenements.domain-service.ts:30:36
 	}
 
-		return evenementsACharger.filter(evenementACharger =>
-			!evenementsExistants.find(evenementExistant => evenementExistant.idSource === evenementACharger.idSource)
+		return evenementsACharger.filter(() => undefined
 		);
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand je 
statusReason: expected stub to have been called with arguments [
  {
    dateDebut: '2022-11-25T09:30:00',
    description: 'description',
    idSource: '272739',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] ArrowFunction
chargement/domain/service/charger-evenements.domain-service.ts:31:30
 
 		return evenementsACharger.filter(evenementACharger =>
-			!evenementsExistants.find(evenementExistant => evenementExistant.idSource === evenementACharger.idSource)
+			!evenementsExistants.find(() => undefined)
 		);
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:31:51
 
 		return evenementsACharger.filter(evenementACharger =>
-			!evenementsExistants.find(evenementExistant => evenementExistant.idSource === evenementACharger.idSource)
+			!evenementsExistants.find(evenementExistant => false)
 		);
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] ArrowFunction
chargement/domain/service/charger-evenements.domain-service.ts:36:37
 	}
 
-		return evenementsExistants.filter(evenementExistant =>
-			!evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
+		return evenementsExistants.filter(() => undefined
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], [
  {
    id: 1,
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] MethodExpression
chargement/domain/service/charger-evenements.domain-service.ts:36:10
 	}
 
-		return evenementsExistants.filter(evenementExistant =>
-			!evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
-		).map(evenementAMettreAJour => ({
+		return evenementsExistants.map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
 			id: evenementsExistants.find(v => v.idSource === evenementAMettreAJour.idSource)!.id,
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[]
[
  {
    id: 1,
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',

[Killed] BooleanLiteral
chargement/domain/service/charger-evenements.domain-service.ts:37:4
 
 		return evenementsExistants.filter(evenementExistant =>
-			!evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
+			evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[]
[
  {
    id: 1,
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',

[Timeout] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:37:50
 
 		return evenementsExistants.filter(evenementExistant =>
-			!evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
+			!evenementsACharger.find(evenementACharger => false)
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:40:38
 			!evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
-			id: evenementsExistants.find(v => v.idSource === evenementAMettreAJour.idSource)!.id,
+			id: evenementsExistants.find(v => true)!.id,
 		}));
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], [
  {
    id: 1,
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:40:38
 			!evenementsACharger.find(evenementACharger => evenementACharger.idSource === evenementExistant.idSource)
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
-			id: evenementsExistants.find(v => v.idSource === evenementAMettreAJour.idSource)!.id,
+			id: evenementsExistants.find(v => false)!.id,
 		}));
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] MethodExpression
chargement/domain/service/charger-evenements.domain-service.ts:45:10
 	}
 
-		return evenementsACharger.filter(evenementACharger =>
-			evenementsExistants.find(evenementExistant =>
-				evenementExistant.idSource === evenementACharger.idSource && !this.deepEqual(evenementExistant, evenementACharger)
-			)
-		).map(evenementAMettreAJour => ({
+		return evenementsACharger.map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
 			id: evenementsExistants.find(v => v.idSource === evenementAMettreAJour.idSource)!.id,
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand je 
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
chargement/domain/service/charger-evenements.domain-service.ts:45:36
 	}
 
-		return evenementsACharger.filter(evenementACharger =>
-			evenementsExistants.find(evenementExistant =>
-				evenementExistant.idSource === evenementACharger.idSource && !this.deepEqual(evenementExistant, evenementACharger)
-			)
+		return evenementsACharger.filter(() => undefined
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [
  {
    id: 3,
    dateDebut: '2022-11-26T09:30:00',
    description: 'description',
    idSource: '272739',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] ArrowFunction
chargement/domain/service/charger-evenements.domain-service.ts:46:29
 
 		return evenementsACharger.filter(evenementACharger =>
-			evenementsExistants.find(evenementExistant =>
-				evenementExistant.idSource === evenementACharger.idSource && !this.deepEqual(evenementExistant, evenementACharger)
+			evenementsExistants.find(() => undefined
 			)
 		).map(evenementAMettreAJour => ({
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [
  {
    id: 3,
    dateDebut: '2022-11-26T09:30:00',
    description: 'description',
    idSource: '272739',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] EqualityOperator
chargement/domain/service/charger-evenements.domain-service.ts:47:5
 		return evenementsACharger.filter(evenementACharger =>
 			evenementsExistants.find(evenementExistant =>
-				evenementExistant.idSource === evenementACharger.idSource && !this.deepEqual(evenementExistant, evenementACharger)
+				evenementExistant.idSource !== evenementACharger.idSource && !this.deepEqual(evenementExistant, evenementACharger)
 			)
 		).map(evenementAMettreAJour => ({
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',

[Killed] BooleanLiteral
chargement/domain/service/charger-evenements.domain-service.ts:47:66
 		return evenementsACharger.filter(evenementACharger =>
 			evenementsExistants.find(evenementExistant =>
-				evenementExistant.idSource === evenementACharger.idSource && !this.deepEqual(evenementExistant, evenementACharger)
+				evenementExistant.idSource === evenementACharger.idSource && this.deepEqual(evenementExistant, evenementACharger)
 			)
 		).map(evenementAMettreAJour => ({
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',

[Killed] ArrowFunction
chargement/domain/service/charger-evenements.domain-service.ts:51:33
 			)
 		).map(evenementAMettreAJour => ({
 			...evenementAMettreAJour,
-			id: evenementsExistants.find(v => v.idSource === evenementAMettreAJour.idSource)!.id,
+			id: evenementsExistants.find(() => undefined)!.id,
 		}));
 	}
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:56:10
 	}
 
 	private deepEqual(evenementExistant: UnJeuneUneSolution.EvenementDejaCharge, nouvelEvenement: UnJeuneUneSolution.Evenement): boolean {
-		return evenementExistant.dateDebut === nouvelEvenement.dateDebut &&
-		evenementExistant.dateFin === nouvelEvenement.dateFin &&
-		evenementExistant.description === nouvelEvenement.description &&
-		evenementExistant.lieuEvenement === nouvelEvenement.lieuEvenement &&
-		evenementExistant.modaliteInscription === nouvelEvenement.modaliteInscription &&
-		evenementExistant.online === nouvelEvenement.online &&
-		evenementExistant.organismeOrganisateur === nouvelEvenement.organismeOrganisateur &&
-		evenementExistant.titreEvenement === nouvelEvenement.titreEvenement &&
-		evenementExistant.typeEvenement === nouvelEvenement.typeEvenement &&
-		evenementExistant.source === nouvelEvenement.source;
+		return false;
 	}
 }
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',

[Killed] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:56:10
 	}
 
 	private deepEqual(evenementExistant: UnJeuneUneSolution.EvenementDejaCharge, nouvelEvenement: UnJeuneUneSolution.Evenement): boolean {
-		return evenementExistant.dateDebut === nouvelEvenement.dateDebut &&
-		evenementExistant.dateFin === nouvelEvenement.dateFin &&
-		evenementExistant.description === nouvelEvenement.description &&
-		evenementExistant.lieuEvenement === nouvelEvenement.lieuEvenement &&
-		evenementExistant.modaliteInscription === nouvelEvenement.modaliteInscription &&
-		evenementExistant.online === nouvelEvenement.online &&
-		evenementExistant.organismeOrganisateur === nouvelEvenement.organismeOrganisateur &&
-		evenementExistant.titreEvenement === nouvelEvenement.titreEvenement &&
-		evenementExistant.typeEvenement === nouvelEvenement.typeEvenement &&
-		evenementExistant.source === nouvelEvenement.source;
+		return true;
 	}
 }
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [
  {
    id: 3,
    dateDebut: '2022-11-26T09:30:00',
    description: 'description',
    idSource: '272739',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',

[Killed] EqualityOperator
chargement/domain/service/charger-evenements.domain-service.ts:57:3
 
 	private deepEqual(evenementExistant: UnJeuneUneSolution.EvenementDejaCharge, nouvelEvenement: UnJeuneUneSolution.Evenement): boolean {
 		return evenementExistant.dateDebut === nouvelEvenement.dateDebut &&
-		evenementExistant.dateFin === nouvelEvenement.dateFin &&
+		evenementExistant.dateFin !== nouvelEvenement.dateFin &&
 		evenementExistant.description === nouvelEvenement.description &&
 		evenementExistant.lieuEvenement === nouvelEvenement.lieuEvenement &&
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',

[Survived] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:57:3
 
 	private deepEqual(evenementExistant: UnJeuneUneSolution.EvenementDejaCharge, nouvelEvenement: UnJeuneUneSolution.Evenement): boolean {
 		return evenementExistant.dateDebut === nouvelEvenement.dateDebut &&
-		evenementExistant.dateFin === nouvelEvenement.dateFin &&
+		true &&
 		evenementExistant.description === nouvelEvenement.description &&
 		evenementExistant.lieuEvenement === nouvelEvenement.lieuEvenement &&

[Killed] EqualityOperator
chargement/domain/service/charger-evenements.domain-service.ts:58:3
 	private deepEqual(evenementExistant: UnJeuneUneSolution.EvenementDejaCharge, nouvelEvenement: UnJeuneUneSolution.Evenement): boolean {
 		return evenementExistant.dateDebut === nouvelEvenement.dateDebut &&
 		evenementExistant.dateFin === nouvelEvenement.dateFin &&
-		evenementExistant.description === nouvelEvenement.description &&
+		evenementExistant.description !== nouvelEvenement.description &&
 		evenementExistant.lieuEvenement === nouvelEvenement.lieuEvenement &&
 		evenementExistant.modaliteInscription === nouvelEvenement.modaliteInscription &&
killedBy: ChargerEvenenementsDomainServiceTest lorsque je veux charger une liste d'évenements je recupere les évenements existants puis je veux les évenements à ajouter, à mettre à jour et à supprimer quand j'a
statusReason: expected stub to have been called with arguments [], [], []
[]
[
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',

[Survived] ConditionalExpression
chargement/domain/service/charger-evenements.domain-service.ts:58:3
 	private deepEqual(evenementExistant: UnJeuneUneSolution.EvenementDejaCharge, nouvelEvenement: UnJeuneUneSolution.Evenement): boolean {
 		return evenementExistant.dateDebut === nouvelEvenement.dateDebut &&
 		evenementExistant.dateFin === nouvelEvenement.dateFin &&
-		evenementExistant.description === nouvelEvenement.description &&
+		true &&
 		evenementExistant.lieuEvenement === nouvelEvenement.lieuEvenement &&
 		evenementExistant.modaliteInscription === nouvelEvenement.modaliteInscription &&
