[NoCoverage] ObjectLiteral
src/evenements/extraction/index.ts:21:16
     }
 
     private static create(configuration: Configuration, usecases: UsecaseContainer): SousModule {
-        return {
-            "tous-mobilises": new ExtractFluxEvenementTousMobilisesTask(usecases.extraireEvenementsTousMobilises, configuration),
-        };
+        return {};
     }
 }
