[Killed] BlockStatement
evenements/transformation/application-service/transformer-flux-tous-mobilises.usecase.ts:14:65
 	) {
 	}
 
-	public async executer(flux: FluxTransformation): Promise<void> {
-		const contenuDuFlux = await this.evenementsRepository.recuperer<Array<TousMobilises.Contenu>>(flux);
-
-		await this.evenementsRepository.sauvegarder(this.convertir.depuisTousMobilises(contenuDuFlux), flux);
-	}
+	public async executer(flux: FluxTransformation): Promise<void> {}
 }
 
killedBy: TransformerFluxTousMobilisesUseCase Lorsque je récupère un flux provenent du flux tous mobilises je retourne une liste d'évenement d'un jeune une solution
statusReason: expected stub to have been called with arguments [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,
