[Killed] MethodExpression
domain/service/tous-mobilises/convertir.domain-service.ts:14:10
 	}
 
 	public depuisTousMobilises(evenements: Array<TousMobilises.Contenu>): Array<UnJeuneUneSolution.Evenement> {
-		return evenements.filter(evenement => evenement.date && evenement.description).map((evenement: TousMobilises.Contenu) => {
+		return evenements.map((evenement: TousMobilises.Contenu) => {
 			return {
 				dateDebut: this.dateService.toIsoDateAvecDateEtHoraire(evenement.date, evenement.horaireDebutEvenement),
killedBy: TransformerFluxTousMobilisesUseCase Lorsque je récupère un item qui n'a pas de date dans le flux je l'ignore et je retourne une liste d'évenement d'un jeune une solution
statusReason: expected stub to have been called with arguments [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] ArrowFunction
domain/service/tous-mobilises/convertir.domain-service.ts:14:28
 	}
 
 	public depuisTousMobilises(evenements: Array<TousMobilises.Contenu>): Array<UnJeuneUneSolution.Evenement> {
-		return evenements.filter(evenement => evenement.date && evenement.description).map((evenement: TousMobilises.Contenu) => {
+		return evenements.filter(() => undefined).map((evenement: TousMobilises.Contenu) => {
 			return {
 				dateDebut: this.dateService.toIsoDateAvecDateEtHoraire(evenement.date, evenement.horaireDebutEvenement),
killedBy: TransformerFluxTousMobilisesUseCase Lorsque je récupère un flux provenent du flux tous mobilises je retourne une liste d'évenement d'un jeune une solution
statusReason: expected stub to have been called with arguments [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Killed] EqualityOperator
domain/service/tous-mobilises/convertir.domain-service.ts:22:13
 				idSource: evenement.id,
 				lieuEvenement: evenement.lieuEvenement,
 				modaliteInscription: this.assainisseurDeTexte.nettoyer(evenement.modaliteInscription),
-				online: evenement.online === "true",
+				online: evenement.online !== "true",
 				organismeOrganisateur: evenement.organismeOrganisateur,
 				titreEvenement: evenement.titreEvenement,
killedBy: TransformerFluxTousMobilisesUseCase Lorsque je récupère un flux provenent du flux tous mobilises je retourne une liste d'évenement d'un jeune une solution
statusReason: expected stub to have been called with arguments [
  {
    dateDebut: '2022-11-24T09:00:00',
    description: 'description',
    idSource: '272709',
    lieuEvenement: 'lieuEvenement',
    modaliteInscription: 'modaliteInscription',
    online: false,

[Timeout] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:22:13
 				idSource: evenement.id,
 				lieuEvenement: evenement.lieuEvenement,
 				modaliteInscription: this.assainisseurDeTexte.nettoyer(evenement.modaliteInscription),
-				online: evenement.online === "true",
+				online: true,
 				organismeOrganisateur: evenement.organismeOrganisateur,
 				titreEvenement: evenement.titreEvenement,

[NoCoverage] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:33:4
 
 	private desinfecteTypeEvenement(typeEvenement: string): string {
 		switch (typeEvenement) {
-			case "Job dating":
-				return "job_dating";
+			case "Job dating":
 			case "Atelier":
 				return "atelier";

[NoCoverage] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:35:4
 		switch (typeEvenement) {
 			case "Job dating":
 				return "job_dating";
-			case "Atelier":
-				return "atelier";
+			case "Atelier":
 			case "Réunion d'information":
 				return "reunion_information";

[NoCoverage] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:37:4
 				return "job_dating";
 			case "Atelier":
 				return "atelier";
-			case "Réunion d'information":
-				return "reunion_information";
+			case "Réunion d'information":
 			case "Conférence":
 				return "conference";

[Survived] StringLiteral
domain/service/tous-mobilises/convertir.domain-service.ts:37:9
 				return "job_dating";
 			case "Atelier":
 				return "atelier";
-			case "Réunion d'information":
+			case "":
 				return "reunion_information";
 			case "Conférence":

[NoCoverage] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:39:4
 				return "atelier";
 			case "Réunion d'information":
 				return "reunion_information";
-			case "Conférence":
-				return "conference";
+			case "Conférence":
 			case "Salon en ligne":
 				return "salon_en_ligne";

[Survived] StringLiteral
domain/service/tous-mobilises/convertir.domain-service.ts:39:9
 				return "atelier";
 			case "Réunion d'information":
 				return "reunion_information";
-			case "Conférence":
+			case "":
 				return "conference";
 			case "Salon en ligne":

[NoCoverage] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:41:4
 				return "reunion_information";
 			case "Conférence":
 				return "conference";
-			case "Salon en ligne":
-				return "salon_en_ligne";
+			case "Salon en ligne":
 			case "Forum":
 				return "forum";

[Survived] StringLiteral
domain/service/tous-mobilises/convertir.domain-service.ts:41:9
 				return "reunion_information";
 			case "Conférence":
 				return "conference";
-			case "Salon en ligne":
+			case "":
 				return "salon_en_ligne";
 			case "Forum":

[NoCoverage] ConditionalExpression
domain/service/tous-mobilises/convertir.domain-service.ts:43:4
 				return "conference";
 			case "Salon en ligne":
 				return "salon_en_ligne";
-			case "Forum":
-				return "forum";
+			case "Forum":
 			default:
 				return typeEvenement;

[Survived] StringLiteral
domain/service/tous-mobilises/convertir.domain-service.ts:43:9
 				return "conference";
 			case "Salon en ligne":
 				return "salon_en_ligne";
-			case "Forum":
+			case "":
 				return "forum";
 			default:
