[NoCoverage] ObjectLiteral
src/evenements/transformation/index.ts:21:10
 	}
 
 	private static create(configuration: Configuration, useCaseContainer: UseCaseContainer): SousModule {
-		return {
-			"tous-mobilises": new TransformFlowJobteaserTask(useCaseContainer.transformerFluxTousMobilisesUsecase, configuration),
-		};
+		return {};
 	}
 }
