[Killed] BlockStatement
logements/chargement/application-service/charger-flux-immojeune.usecase.ts:11:61
 	constructor(private readonly chargerAnnoncesDeLogement: ChargerAnnoncesDeLogementDomainService) {
 	}
 
-	public async executer(flux: FluxChargement): Promise<void> {
-		await this.chargerAnnoncesDeLogement.charger(flux);
-	}
+	public async executer(flux: FluxChargement): Promise<void> {}
 }
 
killedBy: ChargerFluxImmojeuneTest Lorsque je charge le flux Immojeune je charge les annonces de logement issues d'Immojeune
statusReason: expected charger to have been called exactly once with arguments FluxChargement { nom: 'immojeune', extension: '.json' }
