[Killed] BlockStatement
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:9:60
 	constructor(private readonly annonceDeLogementRepository: AnnonceDeLogementRepository) {
 	}
 
-	public async charger(flux: FluxChargement): Promise<void> {
-		const annoncesDeLogementACharger = await this.annonceDeLogementRepository.recupererAnnoncesDeLogementNonReferencees(flux);
-		const annoncesDeLogementDejaChargees = await this.annonceDeLogementRepository.recupererAnnoncesDeLogementReferencees(flux);
-
-		const annoncesAcharger = [
-			...this.filtrerLesNouvellesAnnoncesACharger(annoncesDeLogementDejaChargees, annoncesDeLogementACharger),
-			...this.filtrerLesAnnoncesASupprimer(annoncesDeLogementDejaChargees, annoncesDeLogementACharger),
-			...this.filtrerLesAnnoncesAMettreAJour(annoncesDeLogementDejaChargees, annoncesDeLogementACharger),
-		];
-		const annoncesEnErreur = await this.annonceDeLogementRepository.charger(annoncesAcharger, flux.nom);
-
-		await this.annonceDeLogementRepository.preparerLeSuivi(
-			[
-				...annoncesAcharger,
-				...annoncesEnErreur,
-			],
-			flux
-		);
-	}
+	public async charger(flux: FluxChargement): Promise<void> {}
 
 	private filtrerLesNouvellesAnnoncesACharger(
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je récupère mon flux
statusReason: expected stub to have been called exactly once, but it was called 0 times

[Timeout] MethodExpression
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:35:10
 	): Array<UnJeune1Solution.NouvelleAnnonceDeLogement> {
 		const identifiantsSourcesReferences = annoncesDeLogementDejaChargees
 			.map((annonceReferencee) => annonceReferencee.identifiantSource);
-		return annoncesDeLogementACharger
-			.filter((annonceDeLogement) => !(identifiantsSourcesReferences.includes(annonceDeLogement.identifiantSource)))
+		return annoncesDeLogementACharger
 			.map((annonceDeLogement) => new UnJeune1Solution.NouvelleAnnonceDeLogement(annonceDeLogement.recupererAttributs()));
 	}

[Timeout] ArrowFunction
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:36:12
 		const identifiantsSourcesReferences = annoncesDeLogementDejaChargees
 			.map((annonceReferencee) => annonceReferencee.identifiantSource);
 		return annoncesDeLogementACharger
-			.filter((annonceDeLogement) => !(identifiantsSourcesReferences.includes(annonceDeLogement.identifiantSource)))
+			.filter(() => undefined)
 			.map((annonceDeLogement) => new UnJeune1Solution.NouvelleAnnonceDeLogement(annonceDeLogement.recupererAttributs()));
 	}

[Timeout] BooleanLiteral
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:36:35
 		const identifiantsSourcesReferences = annoncesDeLogementDejaChargees
 			.map((annonceReferencee) => annonceReferencee.identifiantSource);
 		return annoncesDeLogementACharger
-			.filter((annonceDeLogement) => !(identifiantsSourcesReferences.includes(annonceDeLogement.identifiantSource)))
+			.filter((annonceDeLogement) => identifiantsSourcesReferences.includes(annonceDeLogement.identifiantSource))
 			.map((annonceDeLogement) => new UnJeune1Solution.NouvelleAnnonceDeLogement(annonceDeLogement.recupererAttributs()));
 	}

[Killed] MethodExpression
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:46:10
 	): Array<UnJeune1Solution.AnnonceDeLogementObsolete> {
 		const identifiantsSourceACharger = annoncesDeLogementACharger
 			.map((annonceNonReferencee) => annonceNonReferencee.identifiantSource);
-		return annoncesDeLogementReferencees
-			.filter((annonceReferencee) => !(identifiantsSourceACharger.includes(annonceReferencee.identifiantSource)))
+		return annoncesDeLogementReferencees
 			.map((annonceObsolete) => new UnJeune1Solution.AnnonceDeLogementObsolete(
 				{
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je charge mon flux
statusReason: expected [ [ …(4) ], 'Immojeune' ] to have the same members as [ [ …(3) ], 'Immojeune' ]

[Killed] BooleanLiteral
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:47:35
 		const identifiantsSourceACharger = annoncesDeLogementACharger
 			.map((annonceNonReferencee) => annonceNonReferencee.identifiantSource);
 		return annoncesDeLogementReferencees
-			.filter((annonceReferencee) => !(identifiantsSourceACharger.includes(annonceReferencee.identifiantSource)))
+			.filter((annonceReferencee) => identifiantsSourceACharger.includes(annonceReferencee.identifiantSource))
 			.map((annonceObsolete) => new UnJeune1Solution.AnnonceDeLogementObsolete(
 				{
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je charge mon flux
statusReason: expected [ [ …(3) ], 'Immojeune' ] to have the same members as [ [ …(3) ], 'Immojeune' ]

[Timeout] ArrowFunction
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:47:12
 		const identifiantsSourceACharger = annoncesDeLogementACharger
 			.map((annonceNonReferencee) => annonceNonReferencee.identifiantSource);
 		return annoncesDeLogementReferencees
-			.filter((annonceReferencee) => !(identifiantsSourceACharger.includes(annonceReferencee.identifiantSource)))
+			.filter(() => undefined)
 			.map((annonceObsolete) => new UnJeune1Solution.AnnonceDeLogementObsolete(
 				{

[Killed] BlockStatement
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:63:53
 	): Array<UnJeune1Solution.AnnonceDeLogementAMettreAJour> {
 		const result: Array<UnJeune1Solution.AnnonceDeLogementAMettreAJour> = [];
 
-		for (const annonce of annoncesDeLogementACharger) {
-			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(current => current.identifiantSource == annonce.identifiantSource);
-
-			if (annonceDejaChargee !== undefined && new Date(annonce.sourceUpdatedAt).getTime() > new Date(annonceDejaChargee.sourceUpdatedAt).getTime()) {
-				result.push(new UnJeune1Solution.AnnonceDeLogementAMettreAJour(
-					{ ...annonce }, annonceDejaChargee.id,
-				));
-			}
-		}
+		for (const annonce of annoncesDeLogementACharger) {}
 		return result;
 	}
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je charge mon flux
statusReason: expected [ [ …(2) ], 'Immojeune' ] to have the same members as [ [ …(3) ], 'Immojeune' ]

[Killed] ArrowFunction
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:64:67
 		const result: Array<UnJeune1Solution.AnnonceDeLogementAMettreAJour> = [];
 
 		for (const annonce of annoncesDeLogementACharger) {
-			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(current => current.identifiantSource == annonce.identifiantSource);
+			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(() => undefined);
 
 			if (annonceDejaChargee !== undefined && new Date(annonce.sourceUpdatedAt).getTime() > new Date(annonceDejaChargee.sourceUpdatedAt).getTime()) {
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je charge mon flux
statusReason: expected [ [ …(2) ], 'Immojeune' ] to have the same members as [ [ …(3) ], 'Immojeune' ]

[Killed] ConditionalExpression
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:64:78
 		const result: Array<UnJeune1Solution.AnnonceDeLogementAMettreAJour> = [];
 
 		for (const annonce of annoncesDeLogementACharger) {
-			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(current => current.identifiantSource == annonce.identifiantSource);
+			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(current => true);
 
 			if (annonceDejaChargee !== undefined && new Date(annonce.sourceUpdatedAt).getTime() > new Date(annonceDejaChargee.sourceUpdatedAt).getTime()) {
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je charge mon flux
statusReason: expected [ [ …(3) ], 'Immojeune' ] to have the same members as [ [ …(3) ], 'Immojeune' ]

[Killed] ConditionalExpression
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:66:44
 		for (const annonce of annoncesDeLogementACharger) {
 			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(current => current.identifiantSource == annonce.identifiantSource);
 
-			if (annonceDejaChargee !== undefined && new Date(annonce.sourceUpdatedAt).getTime() > new Date(annonceDejaChargee.sourceUpdatedAt).getTime()) {
+			if (annonceDejaChargee !== undefined && true) {
 				result.push(new UnJeune1Solution.AnnonceDeLogementAMettreAJour(
 					{ ...annonce }, annonceDejaChargee.id,
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque j'ai des différences entre le flux récupéré d'Immojeune et le contenu existant et que j'ai de nouvelles annonces je charge ces nouvelles offres
statusReason: expected stub to have been called exactly once with arguments [
  NouvelleAnnonceDeLogement {
    identifiantSource: 'identifiant-source',
    nombreDePieces: 1,
    titre: "Le titre de l'annonce",
    description: "La description de l'annonce",
    url: 'https://some.url',
    source: 'immojeune',

[Killed] EqualityOperator
chargement/domain/service/charger-annonces-de-logement.domain-service.ts:66:44
 		for (const annonce of annoncesDeLogementACharger) {
 			const annonceDejaChargee = annoncesDeLogementDejaChargees.find(current => current.identifiantSource == annonce.identifiantSource);
 
-			if (annonceDejaChargee !== undefined && new Date(annonce.sourceUpdatedAt).getTime() > new Date(annonceDejaChargee.sourceUpdatedAt).getTime()) {
+			if (annonceDejaChargee !== undefined && new Date(annonce.sourceUpdatedAt).getTime() <= new Date(annonceDejaChargee.sourceUpdatedAt).getTime()) {
 				result.push(new UnJeune1Solution.AnnonceDeLogementAMettreAJour(
 					{ ...annonce }, annonceDejaChargee.id,
killedBy: ChargerAnnoncesDeLogementDomainServiceTest Lorsque je charge le flux Immojeune sur mon dépôt distant je charge mon flux
statusReason: expected [ [ …(2) ], 'Immojeune' ] to have the same members as [ [ …(3) ], 'Immojeune' ]
