[Killed] BlockStatement
logements/transformation/application-service/transformer-flux-immojeune.usecase.ts:14:60
 	) {
 	}
 
-	public async executer(flux: FluxImmojeune): Promise<void> {
-		const contenu = await this.repository.recuperer<Array<Immojeune.AnnonceDeLogement>>(flux);
-
-		const annoncesDeLogement = contenu.map(value => this.convertir.depuisImmojeune(value));
-
-		await this.repository.sauvegarder(annoncesDeLogement, flux);
-	}
+	public async executer(flux: FluxImmojeune): Promise<void> {}
 }
 
killedBy: TransformerFluxImmojeuneTest Lorsque je transforme le flux en provenance d'immojeune je récupère le contenu du flux stocké sur le répertoire distant
statusReason: expected stub to have been called exactly once with arguments FluxTransformation {
  nom: 'flux',
  extension: '.json',
  dossierHistorisation: 'old',
  extensionFichierBrut: '.json',
  extensionFichierTransforme: '.json'
}
