[Timeout] BlockStatement
logements/transformation/application-service/transformer-flux-studapart.usecase.ts:14:60
 	) {
 	}
 
-	public async executer(flux: FluxImmojeune): Promise<void> {
-		const contenu = await this.repository.recuperer<Studapart.Contenu>(flux);
-
-		const annoncesDeLogement = contenu.unjeuneunesolution.item.map(studapartLogement => this.convertir.depuisStudapartVersUnJeuneUneSolution(studapartLogement));
-
-		await this.repository.sauvegarder(annoncesDeLogement, flux);
-	}
+	public async executer(flux: FluxImmojeune): Promise<void> {}
 }
 
