[Killed] EqualityOperator
domain/model/studapart/studapart-boolean.value-object.ts:5:23
     private readonly _value: boolean;
 
     constructor(value: "0" | "1") {
-        this._value = value === "1";
+        this._value = value !== "1";
     }
 
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }

[Timeout] ConditionalExpression
domain/model/studapart/studapart-boolean.value-object.ts:5:23
     private readonly _value: boolean;
 
     constructor(value: "0" | "1") {
-        this._value = value === "1";
+        this._value = false;
     }
 
