[Killed] ObjectLiteral
domain/service/immojeune/convertir.domain-service.ts:45:22
 			imagesUrl: annonceDeLogement.pictures.map((picture) => ({ value: picture })),
 			sourceCreatedAt: this.interpreterLaDateSiFrancaise(annonceDeLogement.date_creation, maintenant),
 			sourceUpdatedAt: this.interpreterLaDateSiFrancaise(annonceDeLogement.date_update, maintenant),
-			bilanEnergetique: {
-				consommationEnergetique: this.saisirLeBilanEnergetiqueSiRenseigne(annonceDeLogement.energyConsumption),
-				emissionDeGaz: this.saisirLeBilanEnergetiqueSiRenseigne(annonceDeLogement.greenhouseGasesEmission),
-			},
+			bilanEnergetique: {},
 			localisation: {
 				adresse: annonceDeLogement.address,
killedBy: TransformerFluxImmojeuneTest Lorsque je transforme le flux en provenance d'immojeune je sauvegarde le contenu du flux transformé sur le répertoire distant
statusReason: expected stub to have been called with arguments [
  {
    identifiantSource: 'identifiant-source',
    titre: "Le titre de l'annonce",
    description: "La description de l'annonce",
    charge: 80,
    devise: '€',
    garantie: 2500,

[Killed] ConditionalExpression
domain/service/immojeune/convertir.domain-service.ts:70:7
 			return maintenant;
 		}
 		const dateInterpretee = this.dateService.toIsoDateFromFrenchFormatWithSeconds(date);
-		if (dateInterpretee) {
+		if (false) {
 			return dateInterpretee;
 		}
killedBy: TransformerFluxImmojeuneTest Lorsque je transforme le flux en provenance d'immojeune Et que le format de la date de création est au format français retourne la date au format ISO 8601
statusReason: expected [ [ { …(25) } ], …(1) ] to have the same members as [ [ { …(25) } ], …(1) ]

[Timeout] BlockStatement
domain/service/immojeune/convertir.domain-service.ts:70:24
 			return maintenant;
 		}
 		const dateInterpretee = this.dateService.toIsoDateFromFrenchFormatWithSeconds(date);
-		if (dateInterpretee) {
-			return dateInterpretee;
-		}
+		if (dateInterpretee) {}
 		return date;
 	}

[Killed] BlockStatement
domain/service/immojeune/convertir.domain-service.ts:77:41
 	}
 
 	private saisirLeBilanEnergetiqueSiRenseigne(bilanEnergetique: string): string | undefined {
-		if (bilanEnergetique === "UNDEFINED") {
-			return undefined;
-		}
+		if (bilanEnergetique === "UNDEFINED") {}
 		return bilanEnergetique;
 	}
killedBy: TransformerFluxImmojeuneTest Lorsque je transforme le flux en provenance d'immojeune Et que la consommation énergétique est UNDEFINED dans le flux d'origine retourne undefined
statusReason: expected [ [ { …(25) } ], …(1) ] to have the same members as [ [ { …(25) } ], …(1) ]

[Killed] ConditionalExpression
domain/service/immojeune/convertir.domain-service.ts:77:7
 	}
 
 	private saisirLeBilanEnergetiqueSiRenseigne(bilanEnergetique: string): string | undefined {
-		if (bilanEnergetique === "UNDEFINED") {
+		if (true) {
 			return undefined;
 		}
killedBy: TransformerFluxImmojeuneTest Lorsque je transforme le flux en provenance d'immojeune je sauvegarde le contenu du flux transformé sur le répertoire distant
statusReason: expected stub to have been called with arguments [
  {
    identifiantSource: 'identifiant-source',
    titre: "Le titre de l'annonce",
    description: "La description de l'annonce",
    charge: 80,
    devise: '€',
    garantie: 2500,

[Killed] LogicalOperator
domain/service/immojeune/convertir.domain-service.ts:84:10
 	}
 
 	private traduireLesServicesInclus(servicesInclus: Array<Immojeune.ServiceInclus>): Array<{ nom: UnJeune1Solution.ServiceInclus.Nom }> {
-		return servicesInclus?.map((serviceInclus) => this.traduireLeServiceInclus(serviceInclus)) || [];
+		return servicesInclus?.map(serviceInclus => this.traduireLeServiceInclus(serviceInclus)) && [];
 	}
 
killedBy: TransformerFluxImmojeuneTest Lorsque je transforme le flux en provenance d'immojeune je sauvegarde le contenu du flux transformé sur le répertoire distant
statusReason: expected stub to have been called with arguments [
  {
    identifiantSource: 'identifiant-source',
    titre: "Le titre de l'annonce",
    description: "La description de l'annonce",
    charge: 80,
    devise: '€',
    garantie: 2500,

[Timeout] OptionalChaining
domain/service/immojeune/convertir.domain-service.ts:84:10
 	}
 
 	private traduireLesServicesInclus(servicesInclus: Array<Immojeune.ServiceInclus>): Array<{ nom: UnJeune1Solution.ServiceInclus.Nom }> {
-		return servicesInclus?.map((serviceInclus) => this.traduireLeServiceInclus(serviceInclus)) || [];
+		return servicesInclus.map((serviceInclus) => this.traduireLeServiceInclus(serviceInclus)) || [];
 	}
 

[Timeout] LogicalOperator
domain/service/immojeune/convertir.domain-service.ts:88:10
 	}
 
 	private traduireLesServicesOptionnels(servicesOptionnels: Array<Immojeune.ServiceOptionnel>): Array<UnJeune1Solution.ServiceOptionnel> {
-		return servicesOptionnels?.map((serviceOptionnel) => this.traduireLeServiceOptionnel(serviceOptionnel)) || [];
+		return servicesOptionnels?.map(serviceOptionnel => this.traduireLeServiceOptionnel(serviceOptionnel)) && [];
 	}
 

[Timeout] OptionalChaining
domain/service/immojeune/convertir.domain-service.ts:88:10
 	}
 
 	private traduireLesServicesOptionnels(servicesOptionnels: Array<Immojeune.ServiceOptionnel>): Array<UnJeune1Solution.ServiceOptionnel> {
-		return servicesOptionnels?.map((serviceOptionnel) => this.traduireLeServiceOptionnel(serviceOptionnel)) || [];
+		return servicesOptionnels.map((serviceOptionnel) => this.traduireLeServiceOptionnel(serviceOptionnel)) || [];
 	}
 
