[NoCoverage] ArrayDeclaration
src/shared/configuration/logger.ts:61:27
 			dsn: sentryDsn,
 			release: project.concat("@").concat(release),
 			level: Severity.Error,
-			sentryExceptionLevels: [
-				Severity.Critical,
-				Severity.Error,
-				Severity.Fatal,
-			],
+			sentryExceptionLevels: [],
 		};
 

[NoCoverage] BlockStatement
src/shared/configuration/logger.ts:77:53
 	}
 
 	public create(configuration: LoggerConfiguration): Logger {
-		if (this.environment !== Environment.DEVELOPMENT) {
-			const pinoSentryStream = createWriteStream({
-				...this.sentryConfiguration,
-				decorateScope: ((data: unknown, scope: { setTags: (tags: Record<string, string>) => void }): void => {
-					scope.setTags({ domaine: this.domaine, context: this.context, date: this.now, flow: configuration.name });
-				}),
-			});
-			return pino({ ...configuration, level: this.logLevel }, pino.multistream([pinoSentryStream, { stream: process.stdout }]));
-		}
+		if (this.environment !== Environment.DEVELOPMENT) {}
 		return pino({ ...configuration, level: this.logLevel });
 	}

[NoCoverage] ConditionalExpression
src/shared/configuration/logger.ts:77:7
 	}
 
 	public create(configuration: LoggerConfiguration): Logger {
-		if (this.environment !== Environment.DEVELOPMENT) {
+		if (true) {
 			const pinoSentryStream = createWriteStream({
 				...this.sentryConfiguration,

[NoCoverage] ObjectLiteral
src/shared/configuration/logger.ts:78:47
 
 	public create(configuration: LoggerConfiguration): Logger {
 		if (this.environment !== Environment.DEVELOPMENT) {
-			const pinoSentryStream = createWriteStream({
-				...this.sentryConfiguration,
-				decorateScope: ((data: unknown, scope: { setTags: (tags: Record<string, string>) => void }): void => {
-					scope.setTags({ domaine: this.domaine, context: this.context, date: this.now, flow: configuration.name });
-				}),
-			});
+			const pinoSentryStream = createWriteStream({});
 			return pino({ ...configuration, level: this.logLevel }, pino.multistream([pinoSentryStream, { stream: process.stdout }]));
 		}

[NoCoverage] BlockStatement
src/shared/configuration/logger.ts:80:106
 		if (this.environment !== Environment.DEVELOPMENT) {
 			const pinoSentryStream = createWriteStream({
 				...this.sentryConfiguration,
-				decorateScope: ((data: unknown, scope: { setTags: (tags: Record<string, string>) => void }): void => {
-					scope.setTags({ domaine: this.domaine, context: this.context, date: this.now, flow: configuration.name });
-				}),
+				decorateScope: ((data: unknown, scope: { setTags: (tags: Record<string, string>) => void }): void => {}),
 			});
 			return pino({ ...configuration, level: this.logLevel }, pino.multistream([pinoSentryStream, { stream: process.stdout }]));
