[NoCoverage] BooleanLiteral
src/shared/date.service.ts:9:59
 	}
 
 	public stringifyMaintenant(): string {
-		return DateTime.now().toUTC(undefined, { keepLocalTime: true }).toISO();
+		return DateTime.now().toUTC(undefined, { keepLocalTime: false }).toISO();
 	}
 

[NoCoverage] ObjectLiteral
src/shared/date.service.ts:9:42
 	}
 
 	public stringifyMaintenant(): string {
-		return DateTime.now().toUTC(undefined, { keepLocalTime: true }).toISO();
+		return DateTime.now().toUTC(undefined, {}).toISO();
 	}
 

[Timeout] StringLiteral
src/shared/date.service.ts:13:77
 	}
 
 	public toIsoDateAvecDateEtHoraire(date: string, horaire: string): string {
-		return DateTime.fromFormat(date+" "+horaire, "dd/MM/yyyy HH:mm").toFormat("yyyy-MM-dd'T'HH:mm:ss");
+		return DateTime.fromFormat(date+" "+horaire, "dd/MM/yyyy HH:mm").toFormat("");
 	}
 

[Timeout] StringLiteral
src/shared/date.service.ts:13:35
 	}
 
 	public toIsoDateAvecDateEtHoraire(date: string, horaire: string): string {
-		return DateTime.fromFormat(date+" "+horaire, "dd/MM/yyyy HH:mm").toFormat("yyyy-MM-dd'T'HH:mm:ss");
+		return DateTime.fromFormat(date+""+horaire, "dd/MM/yyyy HH:mm").toFormat("yyyy-MM-dd'T'HH:mm:ss");
 	}
 

[Killed] BooleanLiteral
src/shared/date.service.ts:17:127
 	}
 
 	public toIsoDateAvecDate(date: string): string {
-		return DateTime.fromFormat(date, "dd/MM/yyyy", { locale: "fr-FR", zone: "Europe/Paris" }).toUTC(undefined, { keepLocalTime: true }).toISO();
+		return DateTime.fromFormat(date, "dd/MM/yyyy", { locale: "fr-FR", zone: "Europe/Paris" }).toUTC(undefined, { keepLocalTime: false }).toISO();
 	}
 
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }

[Killed] StringLiteral
src/shared/date.service.ts:17:75
 	}
 
 	public toIsoDateAvecDate(date: string): string {
-		return DateTime.fromFormat(date, "dd/MM/yyyy", { locale: "fr-FR", zone: "Europe/Paris" }).toUTC(undefined, { keepLocalTime: true }).toISO();
+		return DateTime.fromFormat(date, "dd/MM/yyyy", { locale: "fr-FR", zone: "" }).toUTC(undefined, { keepLocalTime: true }).toISO();
 	}
 
killedBy: StudapartTest Lorsque je reçois une annonce studapart de type apartment, rental et avec une seule room je retourne un logement UnJeuneUneSolution de type Appartement avec la garantie de la première pi
statusReason: expected { …(25) } to deeply equal { …(25) }
