[Killed] ConditionalExpression
src/shared/devise.value-object.ts:6:7
 
   constructor(value: string) {
     switch (value) {
-      case "EUR":
-        this._value = "€";
-        break;
+      case "EUR":
       case "GBP":
         this._value = "£";
killedBy: DeviseTest Lorsque la valeur donnée au constructeur est 'EUR' transforme la valeur en €
statusReason: expected '£' to equal '€'

[Killed] StringLiteral
src/shared/devise.value-object.ts:6:12
 
   constructor(value: string) {
     switch (value) {
-      case "EUR":
+      case "":
         this._value = "€";
         break;
killedBy: DeviseTest Lorsque la valeur donnée au constructeur est 'EUR' transforme la valeur en €
statusReason: expected 'non renseignée' to equal '€'

[Killed] ConditionalExpression
src/shared/devise.value-object.ts:9:7
       case "EUR":
         this._value = "€";
         break;
-      case "GBP":
-        this._value = "£";
-        break;
+      case "GBP":
       case "USD":
         this._value = "$";
killedBy: DeviseTest Lorsque la valeur donnée au constructeur est 'GBP' transforme la valeur en £
statusReason: expected '$' to equal '£'

[Killed] StringLiteral
src/shared/devise.value-object.ts:10:23
         this._value = "€";
         break;
       case "GBP":
-        this._value = "£";
+        this._value = "";
         break;
       case "USD":
killedBy: DeviseTest Lorsque la valeur donnée au constructeur est 'GBP' transforme la valeur en £
statusReason: expected '' to equal '£'

[Killed] ConditionalExpression
src/shared/devise.value-object.ts:12:7
       case "GBP":
         this._value = "£";
         break;
-      case "USD":
-        this._value = "$";
-        break;
+      case "USD":
       default:
         this._value = "non renseignée";
killedBy: DeviseTest Lorsque la valeur donnée au constructeur est 'USD' transforme la valeur en $
statusReason: expected 'non renseignée' to equal '$'

[Killed] StringLiteral
src/shared/devise.value-object.ts:16:23
         this._value = "$";
         break;
       default:
-        this._value = "non renseignée";
+        this._value = "";
         break;
     }
killedBy: DeviseTest Lorsque la valeur donnée au constructeur n'est aucune des trois ci-dessus transforme la valeur en 'non renseignée'
statusReason: expected '' to equal 'non renseignée'
