[Killed] BlockStatement
stages/chargement/application-service/charger-flux-jobteaser.usecase.ts:11:61
 	constructor(private readonly chargerOffresDeStages: ChargerOffresDeStageDomainService) {
 	}
 
-	public async executer(flux: FluxChargement): Promise<void> {
-		await this.chargerOffresDeStages.charger(flux);
-	}
+	public async executer(flux: FluxChargement): Promise<void> {}
 }
 
killedBy: ChargerFluxJobteaserTest Lorsque je charge le flux Jobteaser Je charge ce dernier
statusReason: expected charger to have been called exactly once, but it was called 0 times
