[NoCoverage] ObjectLiteral
src/stages/chargement/index.ts:21:10
 	}
 
 	private static create(configuration: Configuration, usecases: UsecaseContainer): SousModule {
-		return {
-			jobteaser: new LoadJobteaserTask(usecases.chargerFluxJobteaser, configuration),
-			"stagefr-compresse" : new LoadStagefrCompressedTask(usecases.chargerFluxStagefrCompresse, configuration),
-			"stagefr-decompresse": new LoadStagefrUncompressedTask(usecases.chargerFluxStagefrDecompresse, configuration),
-		};
+		return {};
 	}
 }
