[NoCoverage] ObjectLiteral
src/stages/extraction/index.ts:25:10
 	}
 
 	private static create(configuration: Configuration, usecases: UsecaseContainer): SousModule {
-		return {
-			jobteaser: new ExtractFluxJobteaserTask(usecases.extraireJobteaser, configuration),
-			"stagefr-compresse": new ExtractFluxStagefrCompressedTask(usecases.extraireStagefrCompresse, configuration),
-			"stagefr-decompresse": new ExtractFluxStagefrUncompressedTask(usecases.extraireStagefrDecompresse, configuration),
-		};
+		return {};
 	}
 }
