[Killed] BlockStatement
stages/transformation/application-service/transformer-flux-jobteaser.usecase.ts:15:65
 	) {
 	}
 
-	public async executer(flux: FluxTransformation): Promise<void> {
-		const contenuDuFlux = await this.offreDeStageRepository.recuperer<Jobteaser.Contenu>(flux);
-
-		const contenuTransforme: Array<UnJeune1Solution.OffreDeStage>
-			= contenuDuFlux.jobs.job.map((job: Jobteaser.OffreDeStage) => this.convertirOffreDeStage.depuisJobteaser(job));
-
-		await this.offreDeStageRepository.sauvegarder(contenuTransforme, flux);
-	}
+	public async executer(flux: FluxTransformation): Promise<void> {}
 }
 
killedBy: TransformerFluxJobteaserTest Lorsque je transforme le flux en provenance de jobteaser Lorsqu'il n'y a qu'un seul domaine je le sauvegarde dans le format attendu
statusReason: expected stub to have been called exactly once, but it was called 0 times
