[Timeout] BlockStatement
stages/transformation/application-service/transformer-flux-stagefr-compresse.usecase.ts:16:65
 	) {
 	}
 
-	public async executer(flux: FluxTransformation): Promise<void> {
-		const contenu = await this.offreDeStageRepository.recuperer<StagefrCompresse.Contenu>(flux);
-
-		const contenuTransforme = this.transformerVers1Jeune1Solution(contenu);
-
-		await this.offreDeStageRepository.sauvegarder(contenuTransforme, flux);
-	}
+	public async executer(flux: FluxTransformation): Promise<void> {}
 
 	private transformerVers1Jeune1Solution(contenu: StagefrCompresse.Contenu): Array<UnJeune1Solution.OffreDeStage> {
