[Timeout] OptionalChaining
domain/service/stagefr-compresse/convertir.domain-service.ts:23:11
 			localisation: {
 				ville: offreDeStage.location.location,
 				codePostal: offreDeStage.location.location_raw,
-				pays: offreDeStage.location.country?.toUpperCase(),
+				pays: offreDeStage.location.country.toUpperCase(),
 				longitude: offreDeStage.location.geo_lng ? offreDeStage.location.geo_lng : 0,
 				latitude: offreDeStage.location.geo_lat ? offreDeStage.location.geo_lat : 0,

[Timeout] MethodExpression
domain/service/stagefr-compresse/convertir.domain-service.ts:23:11
 			localisation: {
 				ville: offreDeStage.location.location,
 				codePostal: offreDeStage.location.location_raw,
-				pays: offreDeStage.location.country?.toUpperCase(),
+				pays: offreDeStage.location.country?.toLowerCase(),
 				longitude: offreDeStage.location.geo_lng ? offreDeStage.location.geo_lng : 0,
 				latitude: offreDeStage.location.geo_lat ? offreDeStage.location.geo_lat : 0,

[Killed] ArrayDeclaration
domain/service/stagefr-compresse/convertir.domain-service.ts:27:14
 				longitude: offreDeStage.location.geo_lng ? offreDeStage.location.geo_lng : 0,
 				latitude: offreDeStage.location.geo_lat ? offreDeStage.location.geo_lat : 0,
 			},
-			domaines: [{ nom: UnJeune1Solution.Domaine.NON_APPLICABLE }],
+			domaines: [],
 			remunerationBase: Number(offreDeStage.salary) || undefined,
 			urlDeCandidature: offreDeStage.url,
killedBy: TransformerFluxStagefrCompresseTest Lorsque je souhaite transformer le flux stagefr compressé et que tout va bien je le sauvegarde au format 1Jeune1Solution
statusReason: expected [ { identifiantSource: '100', …(13) } ] to have the same members as [ { …(14) } ]

[Killed] LogicalOperator
domain/service/stagefr-compresse/convertir.domain-service.ts:28:22
 				latitude: offreDeStage.location.geo_lat ? offreDeStage.location.geo_lat : 0,
 			},
 			domaines: [{ nom: UnJeune1Solution.Domaine.NON_APPLICABLE }],
-			remunerationBase: Number(offreDeStage.salary) || undefined,
+			remunerationBase: Number(offreDeStage.salary) && undefined,
 			urlDeCandidature: offreDeStage.url,
 			sourceCreatedAt: offreDeStage.post_date,
killedBy: TransformerFluxStagefrCompresseTest Lorsque je souhaite transformer le flux stagefr compressé et que tout va bien je le sauvegarde au format 1Jeune1Solution
statusReason: expected [ { identifiantSource: '100', …(13) } ] to have the same members as [ { …(14) } ]

[Killed] LogicalOperator
domain/service/stagefr-compresse/convertir.domain-service.ts:34:17
 			sourcePublishedAt: offreDeStage.post_date,
 			sourceUpdatedAt: offreDeStage.post_date,
 			source: UnJeune1Solution.Source.STAGEFR_COMPRESSE,
-			dureeEnJour: Number(offreDeStage.contract_time) || undefined,
+			dureeEnJour: Number(offreDeStage.contract_time) && undefined,
 		};
 	}
killedBy: TransformerFluxStagefrCompresseTest Lorsque je souhaite transformer le flux stagefr compressé et que tout va bien je le sauvegarde au format 1Jeune1Solution
statusReason: expected [ { identifiantSource: '100', …(13) } ] to have the same members as [ { …(14) } ]
