[Killed] MethodExpression
domain/service/stagefr-decompresse/convertir.domain-service.ts:23:11
 			localisation: {
 				ville: offreDeStage.city,
 				region: offreDeStage.state,
-				pays: offreDeStage.country?.toUpperCase(),
+				pays: offreDeStage.country?.toLowerCase(),
 			},
 			domaines: [{ nom: UnJeune1Solution.Domaine.NON_APPLICABLE }],
killedBy: TransformerFluxStagefrDecompresseTest Lorsque je souhaite transformer le flux stagefr decompressé et que tout va bien je le sauvegarde au format 1Jeune1Solution
statusReason: expected stub to have been called with arguments [
  {
    titre: "Titre de l'offre",
    description: "Description de l'offre",
    domaines: [ [Object] ],
    identifiantSource: 'Identifiant source',
    sourceCreatedAt: '2022-01-01T00:00:00.000Z',
    sourceUpdatedAt: '2022-01-01T00:00:00.000Z',

[Survived] OptionalChaining
domain/service/stagefr-decompresse/convertir.domain-service.ts:23:11
 			localisation: {
 				ville: offreDeStage.city,
 				region: offreDeStage.state,
-				pays: offreDeStage.country?.toUpperCase(),
+				pays: offreDeStage.country.toUpperCase(),
 			},
 			domaines: [{ nom: UnJeune1Solution.Domaine.NON_APPLICABLE }],
